JesusRguez/Universidad/3 GII/1er Semestre/DBM/Proyecto DBM/Entrega/reproductor_mp3_lpc4078_libmad_dac_y_uda1380_recibiendo_por_uart/uart_lpc40xx_xon_xoff.c
/***************************************************************************//**
 * \file    uart_lpc40xx.c
 *
 * \brief   Funciones de manejo de las UARTs del LPC40xx.
 */

#include <LPC407x_8x_177x_8x.h>
#include "uart_lpc40xx_xon_xoff.h"
#include "iocon_lpc40xx.h"
#include "error.h"
#include <string.h>
#include <stdio.h>
#include <math.h>

/* El LPC40xx tiene 5 UARTs. Las UARTs 0, 2 y 3 son exactamente iguales entre
 * sí. La UART 1 añade señales de control de modem y tiene registros adicionales
 * a los de las UARTs 0, 2 y 3. La UART 4 puede funcionar en un modo síncrono y
 * puede comunicar con smart cards, así que también tiene registros adicionales.
 *
 * Las funciones de este módulo no usan ninguna de las características
 * especiales de las UARTs 1 y 4. Las posiciones de los registros comunes a todas
 * las UARTs coinciden, así que todas se manejarán mediante punteros a
 * estructura de tipo LPC_UART_TypeDef.
 */
#define LPC_UART1_  ((LPC_UART_TypeDef*)LPC_UART1_BASE)
#define LPC_UART4_  ((LPC_UART_TypeDef*)LPC_UART4_BASE)
static LPC_UART_TypeDef* const numero_uart_a_puntero[UART_NUMERO_INTERFACES]
    = {LPC_UART0,
       LPC_UART1_,
       LPC_UART2,
       LPC_UART3,
       LPC_UART4_};
    
/* Array con los números de vector de interrupción de cada UART.
 */ 
static const IRQn_Type numero_uart_a_numero_interrupcion[UART_NUMERO_INTERFACES]
    = {UART0_IRQn, UART1_IRQn, UART2_IRQn, UART3_IRQn, UART4_IRQn};
    
/* Indica si una UART ha sido ya inicializada o no.
 */
static bool_t uart_inicializado[UART_NUMERO_INTERFACES] =
    {FALSE, FALSE, FALSE, FALSE, FALSE};
       
/* Array con estructuras con información sobre el estado de las transferencias
 * de cada UART.
 */
//static uart_estado_transferencia_t estado_transferencia[UART_NUMERO_INTERFACES];
static uart_estado_transferencia_t estado_transferencia[1];
   
/* Array para obtener el orden del bit de PCONP que activa la alimentación
 * de cada UART.
 */
static const uint32_t numero_uart_a_bit_pconp[UART_NUMERO_INTERFACES] =
    {3, 4, 24, 25, 8};
    
uint32_t uart_puntero_a_numero(LPC_UART_TypeDef *uart_regs)
{
    if (uart_regs == UART0) return 0;
    if (uart_regs == UART1) return 1;
    if (uart_regs == UART2) return 2;
    if (uart_regs == UART3) return 3;
    if (uart_regs == UART4) return 4;
    ERROR("Puntero a UART incorrecto.");
    return 0;
}

void uart_enviar_xon(void)
{
	uart_estado_transferencia_t *est;
	char c = XON;
	est = &estado_transferencia[0];
	
	if (!est->ya_transmitido_xon)
  {
		uart_transmitir(UART0, 1, &c);
		est->ya_transmitido_xon = TRUE;
		est->ya_transmitido_xoff = FALSE;
	}
}

void uart_enviar_xoff(void)
{
	uart_estado_transferencia_t *est;
	char c = XOFF;
	est = &estado_transferencia[0];
	if (!est->ya_transmitido_xoff)
  { 		
		uart_transmitir(UART0, 1, &c);
		est->ya_transmitido_xon = FALSE;
		est->ya_transmitido_xoff = TRUE;
	}
}
	
     
/***************************************************************************//**
 * \brief       Inicializar una UART del LPC40xx.
 *
 * \param[in]   uart_regs               ptr. al bloque de registros de la UART.
 * \param[in]   baudrate                velocidad en baudios requerida.
 * \param[in]   numero_bits_datos       bits de datos a usar. De 5 a 8.
 * \param[in]   tipo_paridad            paridad a usar (NINGUNA, IMPAR o PAR).
 * \param[in]   numero_bits_stop        bits de stop a usar (1 ó 2).
 * \param[in]   puerto_txd              puerto que se desea para la señal TXD.
 * \param[in]   pin_txd                 pin que se desea para la señal TXD.
 * \param[in]   puerto_rxd              puerto que se desea para la señal RXD.
 * \param[in]   pin_rxd                 pin que se desea para la señal RXD.
 * \param[in]   prioridad_interrupcion  prioridad a asignar a int. de la UART.
 * \param[out]  baudrate_real_obtenido  puntero a float32_t donde almacenar el
 *                                      mejor baudrate que se pudo ajustar.
 *                                      Si es NULL no se usa.
 *
 * \note        La razón de especificar los puertos y los pines mediante punteros
 *              a los registros GPIO y máscaras de pin en lugar de números
 *              de puerto y números de pin es conseguir que la forma de
 *              especificar un pin sea igual que la usada en los módulos
 *              gpio_lpc40xx e iocon_lpc40xx. Esto permite usar los mismos
 *              símbolos PUERTOx y PINx definidos en gpio_lpc40xx.h.
 */
void uart_inicializar(LPC_UART_TypeDef *uart_regs,
                      uint32_t baudrate,
                      uint32_t numero_bits_datos,
                      uart_tipo_paridad_t tipo_paridad,
                      uint32_t numero_bits_stop,
                      LPC_GPIO_TypeDef *puerto_txd,
                      uint32_t mascara_pin_txd,
                      LPC_GPIO_TypeDef *puerto_rxd,
                      uint32_t mascara_pin_rxd,
                      uint32_t prioridad_interrupcion,
                      float32_t *baudrate_real_obtenido)
{
    uint32_t lcr_word_length_select;
    uint32_t lcr_stop_bit_select;
    uint32_t lcr_parity_enable;
    uint32_t lcr_parity_select;
    uint32_t dlmdll;
    uint32_t divaddval;
    uint32_t mulval;
    uint32_t temp;
    uint32_t i;
    uint32_t num;
    uint32_t den;
    float32_t error_relativo;
    float32_t mejor_error_relativo;
    uint32_t numero_uart;
    IRQn_Type numero_interrupcion;
    volatile uint32_t dummy;
    uart_estado_transferencia_t *est;

    /* Comprobar que los parámetros son correctos.
     */
    ASSERT(uart_regs == UART0 || uart_regs == UART1 || uart_regs == UART2 ||
           uart_regs == UART3 || uart_regs == UART4,  
           "Puntero a registros de UART incorrecto.");
    
    ASSERT(numero_bits_datos >= 5 && numero_bits_datos <= 8,
           "Número de bits de datos seleccionado incorrecto.");
    
    ASSERT(tipo_paridad == UART_PARIDAD_NINGUNA ||
           tipo_paridad == UART_PARIDAD_PAR ||
           tipo_paridad == UART_PARIDAD_IMPAR,
           "Paridad seleccionada incorrecta.");
           
    ASSERT(numero_bits_stop == 1 || numero_bits_stop == 2,
           "Número de bits de stop seleccionado incorrecto.");
           
    ASSERT(prioridad_interrupcion < (1u << __NVIC_PRIO_BITS),
        "Prioridad de interrupción incorrecta.");
        
