JesusRguez/Universidad/3 GII/1er Semestre/DBM/Proyecto DBM/Entrega/reproductor_mp3_lpc4078_libmad_dac_y_uda1380_recibiendo_por_uart/uart_lpc40xx_xon_xoff.c
    /* Los números de puerto y pin se comprueban en las funciones de
     * configuración de pines.
     */
     
    numero_uart = uart_puntero_a_numero(uart_regs);

    /* Activar la alimentación de la UART.
     */   
    LPC_SC->PCONP |= 1u << numero_uart_a_bit_pconp[numero_uart];
  
    /* Ajustar la velocidad de comunicación en baudios solicitada.
     *    
     * Primero, calcular la parte entera del divisor de baudrate.
     */
    dlmdll = PeripheralClock/(16*baudrate);  /* dlmdll = 256*DLM + DLL */
    if (dlmdll == 0)
    {
        dlmdll = 1;
    }

    /* Si es neceario, calcular la parte fraccionario del divisor.
     */
    num = 0;
    den = 1;
    divaddval = num;
    mulval = den;    

    if (16*(int32_t)baudrate*(int32_t)dlmdll != PeripheralClock)
    {
        /* La mejor configuración de DIVADDVAL y MULVAL se encontrará probando
         * todos los valores posibles y seleccionando aquellos que hacen mínima
         * el valor absoluto de
         *
         *      DIVADDVAL*a - MULVAL*(PeripheralClock - a)
         *
         *  donde
         *
         *      a = 16*baudrate*(256*DLM + DLL)
         */
        temp = dlmdll;
        mejor_error_relativo =
            fabs(((float)baudrate -
                ((float)PeripheralClock/(16*dlmdll)))/(float)baudrate);
        for (i = temp - 1; i <= temp + 1; i++)
        {
            for (den = 1; den < 16; den++)
            {
                for (num = 1; num < den; num++)
                {
                    error_relativo =
                        fabs(((float)baudrate -
                          ((float)PeripheralClock/((16*i)*(1+(float)num/den))))/
                            (float)baudrate);
                    
                    if (error_relativo < mejor_error_relativo)
                    {
                        dlmdll = i;
                        divaddval = num;
                        mulval = den;
                        mejor_error_relativo = error_relativo;
                    }
                }
            }
        }
    }
      
    /* Escribir los valores calculados en DLM, DLL y FDR.
     */
    uart_regs->LCR |= 0x80;
    uart_regs->DLM = dlmdll >> 8;
    uart_regs->DLL = dlmdll & 0xFF;
    uart_regs->FDR = (mulval << 4) | divaddval;

    if (baudrate_real_obtenido != NULL)
    {
        *baudrate_real_obtenido = (float32_t)(PeripheralClock*mulval)/
                                  (16*dlmdll*(mulval + divaddval));
    }

    /* Configurar el resto de parámetros en el registro LCR.
     */
    lcr_word_length_select = numero_bits_datos - 5;
    lcr_stop_bit_select = numero_bits_stop - 1;
    lcr_parity_enable = tipo_paridad == UART_PARIDAD_NINGUNA ? 0 : 1;
    lcr_parity_select = tipo_paridad == UART_PARIDAD_PAR ? 1 : 0;
    uart_regs->LCR = (lcr_parity_select << 4) |
                        (lcr_parity_enable << 3) |
                        (lcr_stop_bit_select << 2) |
                        lcr_word_length_select;

    /* Activar y limpiar las FIFOs.
     */
    uart_regs->FCR = 0x07;

    /* Según explica el manual del LPC40xx, para que salte la interrupción por
     * Transmit Holding Register Empty deden pasar al menor dos bytes por el
     * THR. Esto no nos conviene en nuestro sistema de gestión de la
     * transmisión así que enviamos dos bytes y esperamos a que salgan.
     * Esto se hace antes de configurar los pines para que la transmisión serie
     * no salga realmente al exterior.
     *
     * Se espara a que tanto el THR como el registro de desplazamiento de
     * transmisión estén vacíos.
     */
//    ptr_interfaz->THR = 0;
//    ptr_interfaz->THR = 0;
//    while ((ptr_interfaz->LSR & (3u << 5)) != (3u << 5)) {}
    
    /* Configurar la interrupción. Se habilita la interrupción por datos
     * disponibles y la interrupción de registro de transmisión vacío.
     */  
    uart_regs->IER = (1u << 0) | (1u << 1);
    //uart_regs->IER = (1u << 0);
    dummy = uart_regs->IIR;  /* Borrar interrupciones. */
    numero_interrupcion = numero_uart_a_numero_interrupcion[numero_uart];        
    NVIC_ClearPendingIRQ(numero_interrupcion);
    NVIC_SetPriority(numero_interrupcion, prioridad_interrupcion);
    __enable_irq();

    /* Configurar los pines indicados.
     */
    switch (numero_uart)
    {
    case 0:
        iocon_configurar_pin(puerto_txd, mascara_pin_txd, U0_TXD,
            IOCON_NO_PULL_UP_NO_PULL_DOWN);
        iocon_configurar_pin(puerto_rxd, mascara_pin_rxd, U0_RXD, IOCON_PULL_UP);
        break;

    case 1:
        iocon_configurar_pin(puerto_txd, mascara_pin_txd, U1_TXD,
            IOCON_NO_PULL_UP_NO_PULL_DOWN);
        iocon_configurar_pin(puerto_rxd, mascara_pin_rxd, U1_RXD, IOCON_PULL_UP);
        break;
    case 2:
        iocon_configurar_pin(puerto_txd, mascara_pin_txd, U2_TXD,
            IOCON_NO_PULL_UP_NO_PULL_DOWN);
        iocon_configurar_pin(puerto_rxd, mascara_pin_rxd, U2_RXD, IOCON_PULL_UP);
        break;
    case 3:
        iocon_configurar_pin(puerto_txd, mascara_pin_txd, U3_TXD,
            IOCON_NO_PULL_UP_NO_PULL_DOWN);
        iocon_configurar_pin(puerto_rxd, mascara_pin_rxd, U3_RXD, IOCON_PULL_UP);
        break;        
    default:
        iocon_configurar_pin(puerto_txd, mascara_pin_txd, U4_TXD,
            IOCON_NO_PULL_UP_NO_PULL_DOWN);
        iocon_configurar_pin(puerto_rxd, mascara_pin_rxd, U4_RXD, IOCON_PULL_UP);
        break;
    }    
    
    /* Inicializar la estructura de estado de transferencia correspondiente.
     */        
    est = &estado_transferencia[numero_uart];
    est->tamano_buffer_transmision = UART_TAMANO_BUFFER_TRANSMISION;
    est->indice_escritura_transmision = 0;
    est->indice_lectura_transmision = 0;
    est->quedan_por_transmitir = 0;
    est->tamano_buffer_recepcion = UART_TAMANO_BUFFER_RECEPCION;
    est->indice_escritura_recepcion = 0;
    est->indice_lectura_recepcion = 0;
    est->disponibles_para_leer = 0;
    est->nivel_inferior = (70*UART_TAMANO_BUFFER_RECEPCION)/100;
    est->nivel_superior = (90*UART_TAMANO_BUFFER_RECEPCION)/100;
    est->ya_transmitido_xoff = FALSE;
    est->ya_transmitido_xon = FALSE;

    /* Indicar que la UART ya ha sido configurada.
     */
    uart_inicializado[numero_uart] = TRUE;
}

/***************************************************************************//**
 * \brief      
 */
void uart_transmitir(LPC_UART_TypeDef *uart_regs,
                     uint32_t numero_bytes_a_transmitir,
                     void *buffer)
{
    uart_estado_transferencia_t *est;
    uint32_t i;
    IRQn_Type numero_interrupcion;
    LPC_UART_TypeDef *ptr_interfaz;
    uint8_t *ptr;
    uint32_t numero_uart;
    
