JesusRguez/Universidad/3 GII/1er Semestre/DBM/Proyecto DBM/Entrega/reproductor_mp3_lpc4078_libmad_dac_y_uda1380_recibiendo_por_uart/uart_lpc40xx_xon_xoff.c
    ASSERT(uart_regs == UART0 || uart_regs == UART1 || uart_regs == UART2 ||
           uart_regs == UART3 || uart_regs == UART4, "uart_regs incorrecto.")       

    numero_uart = uart_puntero_a_numero(uart_regs);
    ASSERT(uart_inicializado[numero_uart],
        "El interfaz no está inicializado."); 
    
    ASSERT(buffer != NULL, "Puntero a buffer es nulo.");
    ASSERT(numero_bytes_a_transmitir != 0,
        "El número de datos a transmitir es 0.");

    est = &estado_transferencia[numero_uart];

    ASSERT(numero_bytes_a_transmitir <=
        UART_TAMANO_BUFFER_TRANSMISION - est->quedan_por_transmitir,
        "No hay espacio suficiente en el buffer de transmisión.");

    /* LA COPIA AL BUFFER DE TRANSMISIÓN NO ESTÁ OPTIMIZADA. SERÍA MEJOR
     * COPIAR EN BLOQUES CON memcpy.
     */

    /* Deshabilitar momentáneamente la interrupción de la UART para tener
     * acceso exclusido a sus variables de estado.
      */
    numero_interrupcion = numero_uart_a_numero_interrupcion[numero_uart];
    NVIC_DisableIRQ(numero_interrupcion);

    i = numero_bytes_a_transmitir;
    ptr = buffer;

    /* Si en este momento no hay datos a transmitir en el buffer de transmisión
     * se envían a la FIFO de transmisión de la UART tantos bytes como se pueda.
     */
    if (est->quedan_por_transmitir == 0)
    {
        while (i > 0 && (ptr_interfaz->LSR & (1u << 5)))    /* bit 5: THRE */ 
        {
            ptr_interfaz->THR = *ptr;
            ptr++;
            i--;
        }                    
    }

    /* Después de enviar directamente a la UART todos los datos que se puedan,
     * colocar el resto en el buffer de transmisión.
     */
    while (i > 0)
    {
        est->buffer_transmision[est->indice_escritura_transmision] = *ptr;       
        if (est->indice_escritura_transmision < UART_TAMANO_BUFFER_TRANSMISION - 1)
        {
            est->indice_escritura_transmision++;
        }
        else
        {
            est->indice_escritura_transmision = 0;
        }
        ptr++;
        est->quedan_por_transmitir++;
        i--;
    }
    
    /* Volver a habilitar las interrupciones de esta UART.
     */
    NVIC_EnableIRQ(numero_interrupcion);
}

/***************************************************************************//**
 * \brief
 */
void uart_esperar_fin_transmision(LPC_UART_TypeDef *uart_regs)
{
    uint32_t numero_uart;
    uart_estado_transferencia_t *est;
    
    ASSERT(uart_regs == UART0 || uart_regs == UART1 || uart_regs == UART2 ||
           uart_regs == UART3 || uart_regs == UART4, "uart_regs incorrecto.");
    
    numero_uart = uart_puntero_a_numero(uart_regs);
    est = &estado_transferencia[numero_uart];
    
    while (est->quedan_por_transmitir != 0) {}
}

/***************************************************************************//**
 * \brief      
 */
bool_t uart_probar_transmitir(LPC_UART_TypeDef *uart_regs,
                              uint32_t numero_bytes_a_transmitir,
                              void *buffer)
{
    uart_estado_transferencia_t *est;
    uint32_t i;
    IRQn_Type numero_interrupcion;
    LPC_UART_TypeDef *ptr_interfaz;
    uint8_t *ptr;
    uint32_t numero_uart;
    
    ASSERT(uart_regs == UART0 || uart_regs == UART1 || uart_regs == UART2 ||
           uart_regs == UART3 || uart_regs == UART4, "uart_regs incorrecto.");

    numero_uart = uart_puntero_a_numero(uart_regs);    
    ASSERT(uart_inicializado[numero_uart],
        "El interfaz no está inicializado.");      
    
    ASSERT(buffer != NULL, "Puntero a buffer es nulo.");
    ASSERT(numero_bytes_a_transmitir != 0,
        "El número de datos a transmitir es 0.");

    est = &estado_transferencia[numero_uart];

    if (numero_bytes_a_transmitir >
        UART_TAMANO_BUFFER_TRANSMISION - est->quedan_por_transmitir)
    {
        return FALSE;
    }

    /* LA COPIA AL BUFFER DE TRANSMISIÓN NO ESTÁ OPTIMIZADA. SERÍA MEJOR
     * COPIAR EN BLOQUES CON memcpy.
     */

    ptr_interfaz = numero_uart_a_puntero[numero_uart];

    /* Deshabilitar momentáneamente la interrupción de la UART para tener
     * acceso exclusido a sus variables de estado.
      */
    numero_interrupcion = numero_uart_a_numero_interrupcion[numero_uart];
    NVIC_DisableIRQ(numero_interrupcion);

    i = numero_bytes_a_transmitir;
    ptr = buffer;

    /* Si en este momento no hay datos a transmitir en el buffer de transmisión
     * se envían a la FIFO de transmisión de la UART tantos bytes como se pueda.
     */
    if (est->quedan_por_transmitir == 0)
    {
        while (i > 0 && (ptr_interfaz->LSR & (1u << 5)))    /* bit 5: THRE */ 
        {
            ptr_interfaz->THR = *ptr;
            ptr++;
            i--;
        }                    
    }

    /* Después de enviar directamente a la UART todos los datos que se puedan,
     * colocar el resto en el buffer de transmisión.
     */
    while (i > 0)
    {
        est->buffer_transmision[est->indice_escritura_transmision] = *ptr;       
        if (est->indice_escritura_transmision < UART_TAMANO_BUFFER_TRANSMISION - 1)
        {
            est->indice_escritura_transmision++;
        }
        else
        {
            est->indice_escritura_transmision = 0;
        }
        ptr++;
        est->quedan_por_transmitir++;
        i--;
    }
    
    /* Volver a habilitar las interrupciones de esta UART.
     */
    NVIC_EnableIRQ(numero_interrupcion);

    return TRUE;
}

/***************************************************************************//**
 * \brief       Indica el número de bytes disponibles en el buffer de recepción
 *              de una UART.
 *
 * \param[in]   numero_interfaz     Número de la UART.
 *
 * \return      Número de bytes disponibles en el buffer de recepción.
 */
uint32_t uart_bytes_disponibles(LPC_UART_TypeDef *uart_regs)
{
    uint32_t disponibles;
    IRQn_Type numero_interrupcion;
    uint32_t numero_uart;

