JesusRguez/Universidad/3 GII/1er Semestre/DBM/Proyecto DBM/Entrega/reproductor_mp3_lpc4078_libmad_dac_y_uda1380_recibiendo_por_uart/uart_lpc40xx_xon_xoff.c
    ASSERT(uart_regs == UART0 || uart_regs == UART1 || uart_regs == UART2 ||
           uart_regs == UART3 || uart_regs == UART4, "uart_regs incorrecto.");
    
    numero_uart = uart_puntero_a_numero(uart_regs);
    ASSERT(uart_inicializado[numero_uart],
        "El interfaz no está inicializado."); 

    numero_interrupcion = numero_uart_a_numero_interrupcion[numero_uart];        
    NVIC_DisableIRQ(numero_interrupcion);
    disponibles = estado_transferencia[numero_uart].disponibles_para_leer;
    NVIC_EnableIRQ(numero_interrupcion);

    return disponibles;
}

/***************************************************************************//**
 * \brief       Lee del buffer de recepción de una UART el número de bytes
 *              indicado. Si el número de bytes disponibles en el buffer de
 *              recepción es menor que el número de bytes solicitado se leen
 *              los que hay disponibles. Si no hay ningún dato disponible no
 *              se lee nada.
 *
 * \param[in]   numero_interfaz     número de la UART.
 * \param[in]   numero_bytes_a_leer número de bytes que se quieren leer.
 * \param[out]  buffer              buffer donde colocar los datos leídos.
 * \param[out]  numero_bytes_leidos número de bytes que realmente se han
 *                                  colocado en el buffer.
 */
void uart_leer(LPC_UART_TypeDef *uart_regs,
               uint32_t numero_bytes_a_leer,
               void *buffer,
               uint32_t* numero_bytes_leidos)
{
    uart_estado_transferencia_t *est;
    IRQn_Type numero_interrupcion;
    uint32_t i;
    uint8_t *ptr;
    uint32_t numero_uart;

    ASSERT(uart_regs == UART0 || uart_regs == UART1 || uart_regs == UART2 ||
           uart_regs == UART3 || uart_regs == UART4, "uart_regs incorrecto.");

    numero_uart = uart_puntero_a_numero(uart_regs);
    ASSERT(uart_inicializado[numero_uart],
        "El interfaz no está inicializado."); 
    
    ASSERT(numero_bytes_leidos != NULL,
        "Puntero numero_bytes_leidos es nulo.");

    est = &estado_transferencia[numero_uart];

    if (est->disponibles_para_leer < numero_bytes_a_leer)
    {
        numero_bytes_a_leer = est->disponibles_para_leer;
    }

    if (numero_bytes_a_leer == 0)
    {
        *numero_bytes_leidos = 0;
        return;
    }

    i = numero_bytes_a_leer;
    ptr = buffer;

    numero_interrupcion = numero_uart_a_numero_interrupcion[numero_uart];        
    NVIC_DisableIRQ(numero_interrupcion);

    while (i > 0)
    {
        *ptr = est->buffer_recepcion[est->indice_lectura_recepcion];
        ptr++;
        if (est->indice_lectura_recepcion < UART_TAMANO_BUFFER_RECEPCION - 1)
        {
            est->indice_lectura_recepcion++;
        }
        else
        {
            est->indice_lectura_recepcion = 0;
        }
        est->disponibles_para_leer--;
        i--;
    }
        
    NVIC_EnableIRQ(numero_interrupcion);

    *numero_bytes_leidos = numero_bytes_a_leer;
    
    if (est->disponibles_para_leer < est->nivel_inferior)
    {
//        uart_regs->THR = XON;
			uart_enviar_xon();
//        if (!est->ya_transmitido_xon)
//        {
//            char c = XON;
//            uart_transmitir(uart_regs, 1, &c);
//            est->ya_transmitido_xon = TRUE;
//            est->ya_transmitido_xoff = FALSE;
//        }
    }
}

/***************************************************************************//**
 * \brief       Esperar a que haya algún dato en el el buffer de recepción de
 *              una UART y leer número de bytes indicado. Si el número de bytes
 *              disponibles en el buffer de recepción es menor que el número de
 *              bytes solicitado se leen los que hay disponibles.
 *
 * \param[in]   numero_interfaz     número de la UART.
 * \param[in]   numero_bytes_a_leer número de bytes que se quieren leer.
 * \param[out]  buffer              buffer donde colocar los datos leídos.
 * \param[out]  numero_bytes_leidos número de bytes que realmente se han
 *                                  colocado en el buffer.
 */
void uart_esperar_leer(LPC_UART_TypeDef *uart_regs,
                       uint32_t numero_bytes_a_leer,
                       void *buffer,
                       uint32_t *numero_bytes_leidos)
{
    uint32_t numero_uart;

    ASSERT(uart_regs == UART0 || uart_regs == UART1 || uart_regs == UART2 ||
           uart_regs == UART3 || uart_regs == UART4, "uart_regs incorrecto.");

    numero_uart = uart_puntero_a_numero(uart_regs);
    ASSERT(uart_inicializado[numero_uart],
        "El interfaz no está inicializado."); 
    
    ASSERT(numero_bytes_leidos != NULL,
        "Puntero numero_bytes_leidos es nulo.");
    
    while (uart_bytes_disponibles(uart_regs) == 0) {}

    uart_leer(uart_regs,
              numero_bytes_a_leer,
              buffer,
              numero_bytes_leidos);
}

/***************************************************************************//**
 * \brief      Manejador de interrupción de la UART0. Llama al
 *             manejador común para las cinco interfaces.
 */
void UART0_IRQHandler(void)
{
    uart_manejador_interrupciones(0);
}

/***************************************************************************//**
 * \brief      Manejador de interrupción de la UART1. Llama al
 *             manejador común para las cinco interfaces.
 */
void UART1_IRQHandler(void)
{
    uart_manejador_interrupciones(1);
}

/***************************************************************************//**
 * \brief      Manejador de interrupción de la UART2. Llama al
 *             manejador común para las cinco interfaces.
 */
void UART2_IRQHandler(void)
{
    uart_manejador_interrupciones(2);
}

/***************************************************************************//**
 * \brief      Manejador de interrupción de la UART3. Llama al
 *             manejador común para las cinco interfaces.
 */
void UART3_IRQHandler(void)
{
    uart_manejador_interrupciones(3);
}

/***************************************************************************//**
 * \brief      Manejador de interrupción de la UART4. Llama al
 *             manejador común para las cinco interfaces.
 */
void UART4_IRQHandler(void)
{
    uart_manejador_interrupciones(4);
}

/***************************************************************************//**
 * \brief      Manjador de interrupción común para los cinco interfaces.
 */
void uart_manejador_interrupciones(uint32_t numero_interfaz)
{
    uart_estado_transferencia_t *est;
    LPC_UART_TypeDef            *ptr_interfaz;
    uint32_t                    iir;
        
    ptr_interfaz = numero_uart_a_puntero[numero_interfaz];
    est = &estado_transferencia[numero_interfaz];

    /* Leer el registro de identificación de interrupción.
     */
    iir = ptr_interfaz->IIR;

    if (iir & 1) return;

    /* El campo INTID (bits 1 a 3) del registro IIR indica la causa de la
     * interrupción.
     */
    switch ((iir >> 1) & 0x07)
    {
        /* 1 => Transmit Holding Register Empty.
         * Acción: si hay datos que transmitir, transmitir el siguiente. En caso
         * contrario no hacer nada.
         */        
        case 1:
            if (est->quedan_por_transmitir != 0)
            {
                ptr_interfaz->THR =
                    est->buffer_transmision[est->indice_lectura_transmision];
                if (est->indice_lectura_transmision < UART_TAMANO_BUFFER_TRANSMISION - 1)
                {
                    est->indice_lectura_transmision++;
                }
                else
                {
                    est->indice_lectura_transmision = 0;
                } 
                est->quedan_por_transmitir--;
            }
            break;

        /* 2 => Receive Data Available.
         * 6 => Character Time-out Indicator.
         * Acción: Recoger el dato y colocarlo en el buffer de recepción.
         */        
        case 2:
        case 6:
            /* Mientras haya datos en la FIFO de recepción del interfaz.
             */
            while (ptr_interfaz->LSR & (1u << 0))
            {
                est->buffer_recepcion[est->indice_escritura_recepcion] =
                    ptr_interfaz->RBR;
                if (est->indice_escritura_recepcion < UART_TAMANO_BUFFER_RECEPCION - 1)
                {
                    est->indice_escritura_recepcion++;
                }
                else
                {
                    est->indice_escritura_recepcion = 0;
                } 
                est->disponibles_para_leer++;
            }
            
            if (est->disponibles_para_leer > est->nivel_superior)
            {
//                ptr_interfaz->THR = XOFF;
							uart_enviar_xoff();
//                if (!est->ya_transmitido_xoff)
//                {
//                    char c = XOFF;
//                    uart_transmitir(ptr_interfaz, 1, &c);
//                    est->ya_transmitido_xoff = TRUE;
//                    est->ya_transmitido_xon = FALSE;
//                }
            }
            
            break;
        
        /* Resto de casos. No deberían presentarse.
         */
        default:
            ERROR("Interrupción imprevista en UART.");
            break;
    }
}
